package study;

public class arrays {

    // 여러 데이터를 하나로 묶는 방법, 순서가 있는 값들의 나열 = 배열

    // 배열 ; 타입(type)의 일종으로, 여러 데이터를 하나로 묶은 것 (마치 책꽂이에 책을 차례대로 꽂는 것과 같)
    // 이러한 배열은 수많은 데이터를 하나의 변수로 관리할 수 있다는 장점.

    // 배열 사용법 :
    // 배열 생성 : 중괄호로 감싸서 값을 담아주기
    // 해당 값들에 대한 이름을 정해주기
    // 타입을 정해주기 -> 단순히 int 이렇게 말고 int의 배열, 대괄호를 넣어서 배열임을 나타내줌
    // 배열을 반복문을 통해 출력해줌 ex. for 문을 사용해서 각각의 정보를 출력함.
    // ex.
    // for (int i = 0; i < 10; i++) {
    //   system.out.print("학생-%d: %d점\n", i, students[i]);

    // 이렇게 students[i] 라고 해서 i 번째 위치값을 가져가서 사용하는 것.
    // 첫 시작은 0번 부터임.


    // 배열 특징 :
    // 1. 모두 타입이 같아야함
    // 예를 들어 int[] students = {값 들} 이렇게 했을 때 int 배열이기 떄문에 안에 있는 값들도 전부 int임

    // 2. 순서가 있음
    // index 라는 순서가 존재함.















}
